app/controllers/posts_controller.rb

	def index
	   @posts = Post.paginate(page: params[:page], per_page: 5)
---
SELECT "posts".* FROM "posts" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

	def create
		@post = Post.new(post_params)

		if @post.save
---
INSERT INTO "posts" ("title", "summary", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "красава"], ["summary", "dsfsdf"], ["body", "d"], ["created_at", "2020-08-12 17:07:37.623096"], ["updated_at", "2020-08-12 17:07:37.623096"]]

	def update
		if @post.update_attributes(post_params)
---
UPDATE "posts" SET "title" = ?, "summary" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First title!ddsqs"], ["summary", "seresqsqsq"], ["updated_at", "2020-08-17 10:00:34.260008"], ["id", 1]]